
// Таблица Б.1. Утилиты типов

// Утилита типов           Используется с                Описание
// -------------------------------------------------------------------------------------------------
// Constructor-Parameters  Типом конструкторов класса    Кортеж типов параметров конструктора класса
// Exclude                 Типом объединения             Исключает тип из другого типа
// Extract                 Типом объединения             Выбирает тип, совместимый с другим типом
// InstanceType            Типом конструкторов класса    Тип экземпляра, получаемый посредством new конструктора класса
// NonNullable             Типом, допускающим null       Исключает null и undefined из типа
// Parameters              Типом функции                 Кортеж типов параметров функции
// Partial                 Типом объектов                Делает все свойства объекта опциональными
// Pick                    Типом объектов                Подтип типа объекта с подмножеством его ключей
// Readonly                Типом массивов, объектов      Делает все свойства объекта, массива или кортежа только для чтения
//                         и кортежей
// ReadonlyArray           Любым типом                   Создает неизменяемый массив заданного типа
// Record                  Типом объектов                Отображает тип ключа на тип значения
// Required                Типом объектов                Делает все свойства объекта необходимыми
// ReturnType              Типом функций                 Возвращаемый тип функции
